profit = float(input('请输入利润: '))
if profit <= 100000:
    profit1 = float(profit*0.1)
    print('奖金可提%s' % (profit1)) #利润()低于或等于10万元时奖金可提10%
    #最高100000,有提成10000
if  100000 < profit <= 200000:
    gt10 = float(profit-100000)  #大于10万的部分
    mt10 = float(gt10*0.075)          #高于10元的部分,可提成7.5%
    protfit10 = ((profit-gt10)*0.1+mt10)
    print('奖金可提%s元' % (protfit10))   #利润高于10万元，低于20万时,低于10万元的部分按10%提成，高于10元的部分,可提成7.5%;
    #最高200000,有提成17500
if 200000 < profit <= 400000:
    gt20 = float(profit-200000)#大于20万的部分
    protfit20 = (17500 + (gt20*0.05))    #20万到40万之间时，高于20万元的部分，可提成5%;
    print('奖金可提%s元' % (protfit20))
    #最高400000,有提成27500
if 400000 < profit <= 600000:
    gt40 = (profit-400000)#大于40万的部分
    protfit40 = 27500+(gt40*0.03)       #40万到60万之间时高于40元的部分，可提成3%;
    print('奖金可提%s元' % (protfit40))
    #最高600000,有提成33500
if 600000 < profit <= 1000000:
    gt60 = (profit-600000)#大于60万的部分
    protfit60 = 33500+(gt60*0.015)       #60万到100万之间时，高汙60万元的部分，可提成1.5%,
    print('奖金可提%s元' % (protfit60))
    #最高1000000,有提成39500
if profit > 1000000:
    gt100 = (profit-1000000)#大于100万的部分
    protfit100 =39500+(gt100*0.01)     #高于100 万元时，超过100万元的部分按 1%提成
    print('奖金可提%s元' % (protfit100))
